Revit 2027 API
PointLightShape(PointLightShape) Constructor
 Creates a copy of the given point light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointLightShape(
	PointLightShape other
)
Public Sub New (
	other As PointLightShape
)
public:
PointLightShape(
	PointLightShape^ other
)
new :
        other : PointLightShape -> PointLightShape
Parameters
other PointLightShape
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointLightShape Class
PointLightShape Overload
Autodesk.Revit.DB.Lighting Namespace